Revit 2024 API
BuiltInFailures.GeneralFailures.ErrorInSymbolFamilyResolved Property
 An error occurred in family "[Name]" and was automatically resolved, but may require review by the family creator.\nError Information:\n"[Text]"\nError Resolution: [Resolution]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ErrorInSymbolFamilyResolved { get; }
Visual Basic
Public Shared ReadOnly Property ErrorInSymbolFamilyResolved As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ErrorInSymbolFamilyResolved {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace